Sergio0799/ESP32-Control-System/src/main.cpp
/* Include necessary libraries */
// Arduino & Serial communication:
#include <Arduino.h>
#include <SPI.h>
#include <Wire.h>
// #include <HardwareSerial.h>
// Sensors (Ultrasonic, Compass, BMI):
#include <NewPing.h>
//#include <Adafruit_Sensor.h>
#include <Adafruit_HMC5883_U.h>
#include <BMI160Gen.h>
//#include <CurieIMU.h>
// Motors & Servos:
#include <L298N.h>
#include <ESP32Servo.h>
// PS5 controller:
#include <ps5Controller.h>

// /* Library and variable initialization for degree calculations from BMI160 */
// #include <MadgwickAHRS.h>
// Madgwick filter;
// unsigned long microsPerReading, microsPrevious;


/* Assign pin names, based on GPIO number: */
// Servos
const int shaftPWM = 16;
const int shaftPWMInvert = 4;
const int scraperPWM = 17;
// Motor Drivers
const int trayMDriverIn2 = 15;
const int trayMDriverIn1 = 2;
const int trackMDriverIn4 = 25;
const int trackMDriverIn3 = 26;
const int trackMDriverIn2 = 27;
const int trackMDriverIn1 = 14;
const int trayEnable = 4;
const int track1Enable = 13;
const int track2Enable = 12;
// Ultrasonic Sensors
const int frontUltrasonicEcho = 34;
const int frontUltrasonicTrig = 32;
const int binUltrasonicEcho = 35;
const int binUltrasonicTrig = 33;
// UART Communication w/ RPi
const int espRX = 3;
const int espTX = 1;
//const int espRX = 16;
//const int espTX = 17;
// I2C Communication w/ Compass
// const int I2CSerialClock = 22;
const int CompassData = 21;
// SPI Communication w/ BMI
const int BMIChipSelect = 5;
// const int BMISerialClock = 18;
const int BMIMISO = 19;
const int BMIMOSI = 23;

/* Initialize necessary structures (from libraries): */
// Servos
Servo shaftServo;
Servo handServo;
Servo shaftServoInvert;
ESP32PWM pwm;
// Motor Drivers
L298N rightMotor(track1Enable, trackMDriverIn1, trackMDriverIn2);
L298N leftMotor(track2Enable, trackMDriverIn3, trackMDriverIn4);
L298N trayMotor(trayEnable, trayMDriverIn1, trayMDriverIn2);
// Ultrasonic Sensors
NewPing sonar(frontUltrasonicTrig, frontUltrasonicEcho, 200);
NewPing binFill(binUltrasonicTrig, binUltrasonicEcho, 40);
//UART Serial Comm w/ RPi
HardwareSerial PiComm(2);
// Compass
Adafruit_HMC5883_Unified mag = Adafruit_HMC5883_Unified(12345);

void setup() {
  // put your setup code here, to run once:
  // Allow allocation of all timers
	ESP32PWM::allocateTimer(0);
	ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
	ESP32PWM::allocateTimer(3);
  // Standard 50hz servos
  shaftServo.setPeriodHertz(50);
  shaftServoInvert.setPeriodHertz(50);
  handServo.setPeriodHertz(50);

  // Mask MAC address onto PS5 controller
  ps5.begin("F0:2F:4B:0F:78:59");

  // Initialize the I2C library
  Wire.begin();
  
  // Initialize serial communication with a 9600 baud rate, through microUSB
  // Serial.begin(9600);
  // // while (!Serial);  // wait for the serial port to open
  // // Serial.println("USB Serial Initialized"); // output to console when opened

  // Initialize serial communication to RPi (9600 bps, 8 bits, No Parity, 1 Stop Bit)
  // If only connected to RPi, use next line and RX0/TX) pins
  PiComm.begin(9600, SERIAL_8N1, espRX, espTX);
  // If connected through USB to ESP use RX2/TX2 pins, for flashing
  //PiComm.begin(9600);
  PiComm.setDebugOutput(true);
  while(!PiComm); // wait for serial port to open
  // // Serial.println("Serial Initialized"); // output to console when opened
  
  // Initialize the SPI library
  SPI.begin();
  SPI.setClockDivider(SPI_CLOCK_DIV4);  //divide the clock by 4

  // Set pins mode for each output
  pinMode(shaftPWM, OUTPUT);
  pinMode(shaftPWMInvert, OUTPUT);
  pinMode(scraperPWM, OUTPUT);
  pinMode(trayMDriverIn2, OUTPUT);
  pinMode(trayMDriverIn1, OUTPUT);
  pinMode(trayEnable, OUTPUT);
  pinMode(trackMDriverIn4, OUTPUT);
  pinMode(trackMDriverIn3, OUTPUT);
  pinMode(trackMDriverIn2, OUTPUT);
  pinMode(trackMDriverIn1, OUTPUT);
  pinMode(track1Enable, OUTPUT);
  pinMode(track2Enable, OUTPUT);
  pinMode(frontUltrasonicTrig, OUTPUT);
  pinMode(binUltrasonicTrig, OUTPUT);
  pinMode(BMIChipSelect, OUTPUT);
  // Set pins mode for each input
  pinMode(frontUltrasonicEcho, INPUT);
  pinMode(binUltrasonicEcho, INPUT);
  // Serial.println("Pins Defined"); // output to console that pins were defined

  // Print error if magnetometor not initialized
  if(!mag.begin()) {
    /* There was a problem detecting the HMC5883 ... check your connections */
    // Serial.println("Ooops, no HMC5883 detected ... Check your wiring!");
    while(1);
  }

  // Give sensors & serial communication time to initialize (100 ms)
  delay(100);
}

float convertRawAcceleration(int aRaw) {  // For BMI
  // since we are using 2G range
  // -2g maps to a raw value of -32768
  // +2g maps to a raw value of 32767
  float a = (aRaw * 2.0) / 32768.0;
  return a;
}

float convertRawGyro(int gRaw) {  // For BMI
  // since we are using 250 degrees/seconds range
  // -250 maps to a raw value of -32768
  // +250 maps to a raw value of 32767
  float g = (gRaw * 250.0) / 32768.0;
  return g;
}

int compassDegree() { // For Magnetometer
  // Get a new sensor event
  sensors_event_t event;
  mag.getEvent(&event);

  // Read heading based on the x & y axis
  float heading = atan2(event.magnetic.y, event.magnetic.x);

  // Add 'Declination Angle', corrects for error in local magnetic field
  // MUST BE UPDATED MANUALLY BASED ON LOCATIION: magnetic-declination.com
  float declinationAngle = 0.0573;
  heading += declinationAngle;

  // Correct for when signs are reversed.
  if(heading < 0)
    heading += 2*PI;
    
  // Check for wrap due to addition of declination.
  if(heading > 2*PI)
    heading -= 2*PI;
  
  // Convert radians to degrees
  float headingDegrees = heading * 180/PI;

  // Return degree currently facing
  return headingDegrees;
}

void turn(int degree) { // For L298Ns
  // Initialize motor driver variable & assign arbitrarily (will be reassigned)
  L298N forwardMotor = trayMotor;
  L298N reverseMotor = trayMotor;

  // Get degree robot is initially facing
  int initDegree = compassDegree();
  // Print message to computer (troubleshooting)
  // Serial.print("Initial degree of robot: ");
  // Serial.println(initDegree);

  // Assign which motor will move forward/reverse based on turning
  if (degree < 0) {
    forwardMotor = leftMotor;
    reverseMotor = rightMotor;
  }
  else if (degree > 0) {
    forwardMotor = rightMotor;
    reverseMotor = leftMotor;
  }
  else {
    
