Sergio0799/ESP32-Control-System/src/main.cpp
  }

  unsigned short dutyCycle = 50;
  int currentDegree, halfwayDegree = degree / 2;
  // Turn robot at incremental speed (no sudden burst of movement)
  for (; dutyCycle < 200; dutyCycle = dutyCycle + 5) {
    forwardMotor.setSpeed(dutyCycle);
    reverseMotor.setSpeed(dutyCycle);
    // Tracks must be rotating in opposite directions for static turn
    forwardMotor.forward();
    reverseMotor.backward();
    // Print message to computer (troubleshooting)
    // Serial.print("Turn with duty cycle: ");
    // Serial.print(dutyCycle);
    // Serial.print(" with function reading of: ");
    // Serial.println(forwardMotor.getSpeed());
    // Constantly check current degree reading and stop accelerating when halfway through turning
    currentDegree = compassDegree();
    if ((initDegree - currentDegree) == halfwayDegree) {
      // Print message to computer (troubleshooting)
      // Serial.print("Slowing turn at degree change: ");
      // Serial.println(initDegree - currentDegree);
      break;
    }
    delay(100);
  }

  // Keep turning even when max speed is reached, until reaching halfway point of turn
  while ((initDegree - currentDegree) != halfwayDegree) {
    currentDegree = compassDegree();
    // Print message to computer (troubleshooting)
    // Serial.print("Current degree: ");
    // Serial.println(currentDegree);
  }
  // Print message to computer (troubleshooting)
  // Serial.print("Slowing turn at degree change: ");
  // Serial.println(initDegree - currentDegree);

  // Decrease speed of turn after halfway (no sudden stop)
  for (; dutyCycle > 60; dutyCycle = dutyCycle - 5) {
    forwardMotor.setSpeed(dutyCycle);
    reverseMotor.setSpeed(dutyCycle);
    // Tracks must be rotating in opposite directions for static turn
    forwardMotor.forward();
    reverseMotor.backward();
    // Print message to computer (troubleshooting)
    // Serial.print("Turn with duty cycle: ");
    // Serial.print(dutyCycle);
    // Serial.print(" with function reading of: ");
    // Serial.println(forwardMotor.getSpeed());
    // Constantly check current degree reading and stop when desired degree change is reached
    currentDegree = compassDegree();
    if ((initDegree - currentDegree) == degree) {
      // Print message to computer (troubleshooting)
      // Serial.print("Slowing turn at degree change: ");
      // Serial.println(initDegree - currentDegree);
      break;
    }
    delay(100);
  }

  // Keep turning even when low speed is reached, until reaching desired degree change
  while ((initDegree - currentDegree) != degree) {
    currentDegree = compassDegree();
    // Print message to computer (troubleshooting)
    // Serial.print("Current degree: ");
    // Serial.println(currentDegree);
  }
  // Print message to computer (troubleshooting)
  // Serial.print("Stopping turn at degree change: ");
  // Serial.println(initDegree - currentDegree);

  // Fully stop turning, should be facing object now
  forwardMotor.stop();
  reverseMotor.stop();
}

void openTray() {
  unsigned short dutyCycle = 50;
  // Move DC motor forward with increasing speed
  for (; dutyCycle < 250; dutyCycle = dutyCycle + 5) {
    trayMotor.setSpeed(dutyCycle);
    trayMotor.backward();
    // Serial.print("Opening with duty cycle: ");
    // Serial.print(dutyCycle);
    // Serial.print(" with function reading of: ");
    // Serial.println(trayMotor.getSpeed());
    delay(50);
  }
  // Move DC motor forward with decreasing speed
  for (; dutyCycle > 80; dutyCycle = dutyCycle - 5) {
    trayMotor.setSpeed(dutyCycle);
    trayMotor.backward();
    // Serial.print("Opening with duty cycle: ");
    // Serial.print(dutyCycle);
    // Serial.print(" with function reading of: ");
    // Serial.println(trayMotor.getSpeed());
    delay(50);
  }
}

void closeTray() {
  unsigned short dutyCycle = 50;
  // Move DC motor forward with increasing speed
  for (; dutyCycle < 250; dutyCycle = dutyCycle + 5) {
    trayMotor.setSpeed(dutyCycle);
    trayMotor.forward();
    // Serial.print("Clowing with duty cycle: ");
    // Serial.print(dutyCycle);
    // Serial.print(" with function reading of: ");
    // Serial.println(trayMotor.getSpeed());
    delay(50);
  }
  // Move DC motor forward with decreasing speed
  for (; dutyCycle > 80; dutyCycle = dutyCycle - 5) {
    trayMotor.setSpeed(dutyCycle);
    trayMotor.forward();
    // Serial.print("Closing with duty cycle: ");
    // Serial.print(dutyCycle);
    // Serial.print(" with function reading of: ");
    // Serial.println(trayMotor.getSpeed());
    delay(50);
  }
}

int bigMinUs = 365; // 365 for MG996R servo (manually calibrated)
int bigMaxUs = 2470; // 2460-2480 for MG996R servo (manually calibrated)
// int smallMinUs = 500; // 500 for SG90 servo (manually calibrated)
// int smallMaxUs = 2400; // 2400 for SG90 servo (manually calibrated)

void lowerShaft() {
  int pos = 0;
  shaftServo.attach(shaftPWM, bigMinUs, bigMaxUs);
  shaftServoInvert.attach(shaftPWMInvert, bigMinUs, bigMaxUs);
  pwm.attachPin(27, 10000); //10khz frequency

  // Turn from 160 degrees to 50 degrees in steps of 1 degree
  for (pos = 160; pos >= 50; pos -= 1) { 
		shaftServo.write(pos);
    shaftServoInvert.write((160-pos)+50);
		delay(20);
	}

  // Print message to computer (troubleshooting)
  // Serial.print("Shaft servo value: ");
  // Serial.println(shaftServo.read());

  shaftServo.detach();
  shaftServoInvert.detach();
  pwm.detachPin(27);
}

void raiseShaft() {
  int pos = 0;
  shaftServo.attach(shaftPWM, bigMinUs, bigMaxUs);
  shaftServoInvert.attach(shaftPWMInvert, bigMinUs, bigMaxUs);
  pwm.attachPin(27, 10000); //10khz frequency

  // Turn from 50 degrees to 160 degrees in steps of 1 degree
  for (pos = 50; pos <= 160; pos += 1) { 
		shaftServo.write(pos);
    shaftServoInvert.write((160-pos)+50);
		delay(20);             // waits 20ms for the servo to reach the position
	}

  // Print message to computer (troubleshooting)
  // Serial.print("Shaft servo value: ");
  // Serial.println(shaftServo.read());

