Sergio0799/ESP32-Control-System/src/main.cpp
        case 'L': { // Turn slightly left while moving forward
          // Initialize necessary local variables for case
          unsigned short dutyCycle = leftMotor.getSpeed();
          unsigned long ping = 0;
          unsigned long distance = 0;
          boolean newInstruction = false;

          // Slowly decelerate left motor to turn slightly left
          for (; dutyCycle > 25; dutyCycle = dutyCycle - 5) {
            leftMotor.setSpeed(dutyCycle);
            leftMotor.forward();
            // Print message to computer (troubleshooting)
            // Serial.print("Left with duty cycle: ");
            // Serial.print(dutyCycle);
            // Serial.print(" While right motor reading of: ");
            // Serial.println(rightMotor.getSpeed());
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(20);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            // Serial.print("Sonar reading: ");
            // Serial.println(distance);
            // If object is close, break out of case
            if (distance > 0 && distance < 50) {
              PiComm.write('7');
              newInstruction = true;
              break;
            }
            delay(50);
          }

          // If finish the loop and still not centered there is an error
          if (!newInstruction) {
            error = true;
          }
          break;
        }

        case 'O': {// Everything ok bro?
          
          break;
        }

        case 'P': { // Engage pickup function
          // Serial.println("Pickup function here");
          // Open hands while still above bin then lower them (around the object)
          openHands();
          lowerShaft();
          // Close hands under object and tilt it into the bin
          closeHands();
          raiseShaft();
          // Tell RPi when finished picking up
          PiComm.write('7');
          break;
        }

        case 'R': { // Turn slightly right while moving forward
          // Initialize necessary local variables for case
          unsigned short dutyCycle = rightMotor.getSpeed();
          unsigned long ping = 0;
          unsigned long distance = 0;
          boolean newInstruction = false;

          // Slowly decelerate left motor to turn slightly left
          for (; dutyCycle > 25; dutyCycle = dutyCycle - 5) {
            rightMotor.setSpeed(dutyCycle);
            rightMotor.forward();
            // Print message to computer (troubleshooting)
            // Serial.print("Right with duty cycle: ");
            // Serial.print(dutyCycle);
            // Serial.print(" While left motor reading of: ");
            // Serial.println(leftMotor.getSpeed());
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(20);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            // Serial.print("Sonar reading: ");
            // Serial.println(distance);
            // If object is close, break out of case
            if (distance > 0 && distance < 50) {
              PiComm.write('7');
              newInstruction = true;
              break;
            }
            delay(50);
          }

          // If finish the loop and still not centered there is an error
          if (!newInstruction) {
            error = true;
          }
          break;
        }

        case 'T': { // Do a 180
          // Serial.println("Doing a full turn");
          turn(180);
          break;
        }

        default: {
          // PiComm.println("Serial communication error");
          // // Serial.println("Serial communication error");
          error = true;
          break;
        }
      }
    } 
    // else Serial.println("Waiting for RPI or PS5 comms");
  } 
  //End of RPI code line
  else if (ps5.isConnected()) { // Manual testing through PS5 controller
    // D-Pad Buttons:
    if (ps5.Right()) closeHands();
    if (ps5.Down()) lowerShaft();
    if (ps5.Up()) raiseShaft();
    if (ps5.Left()) openHands();

    // Shape Buttons:
    if (ps5.Square()) {
      turn(90);
    }
    if (ps5.Cross()) {
      turn(-45);
    }
    if (ps5.Circle()) {
      turn(-90);
    }
    if (ps5.Triangle()) {
      turn(45);
    }

    // L1 - Turn left
    if (ps5.L1()) {
      leftMotor.setSpeed(100);
      rightMotor.setSpeed(100);
      leftMotor.backward();
      rightMotor.forward();

      while(ps5.L1());

      leftMotor.stop();
      rightMotor.stop();
    }
    // L2 - Turn right
    if (ps5.R1()) {
      leftMotor.setSpeed(100);
      rightMotor.setSpeed(100);
      leftMotor.forward();
      rightMotor.backward();

      while(ps5.R1());

      leftMotor.stop();
      rightMotor.stop();
    }
    
    if (ps5.Touchpad()) {
      ps5.setRumble(0, sonar.ping_cm());
    }

    // L2 - Reverse
    if (ps5.L2Value() > 55) {
      // Serial.print("L2 button at ");
      // Serial.println(ps5.L2Value());
      leftMotor.setSpeed(ps5.L2Value());
      leftMotor.backward();
      rightMotor.setSpeed(ps5.L2Value());
      rightMotor.backward();
    }
    // R2 - Forward
    if (ps5.R2Value() > 55) {
      // Serial.print("R2 button at ");
      // Serial.println(ps5.R2Value());
      leftMotor.setSpeed(ps5.R2Value());
      leftMotor.forward();
      rightMotor.setSpeed(ps5.R2Value());
      rightMotor.forward();
    }
  }

  // If there was an error detected then print msg to computer
  if (error) {
    // Serial.println("Something went wrong!");
  }
  // Delay for visual troubleshooting
  //delay(1000);
}